### Terraform Apply - Terraform plan Succeeded
<details><summary>Show Output</summary>
<p>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.vnet_main has been deleted
-   resource "azurerm_resource_group" "vnet_main" {
        id       = "/subscriptions/8b5aa65c-86a2-4818-b2f7-2223b545d57f/resourceGroups/main-vnet"
-       name     = "main-vnet" -> null
        tags     = {}
        # (1 unchanged attribute hidden)
    }

  # module.vnet-main.azurerm_subnet.subnet[0] has been deleted
-   resource "azurerm_subnet" "subnet" {
-       address_prefix                                 = "10.0.3.0/24" -> null
-       address_prefixes                               = [
-           "10.0.3.0/24",
        ] -> null
-       enforce_private_link_endpoint_network_policies = false -> null
-       enforce_private_link_service_network_policies  = false -> null
-       id                                             = "/subscriptions/8b5aa65c-86a2-4818-b2f7-2223b545d57f/resourceGroups/main-vnet/providers/Microsoft.Network/virtualNetworks/main-vnet/subnets/web" -> null
-       name                                           = "web" -> null
-       resource_group_name                            = "main-vnet" -> null
-       service_endpoint_policy_ids                    = [] -> null
-       service_endpoints                              = [] -> null
-       virtual_network_name                           = "main-vnet" -> null
    }

  # module.vnet-main.azurerm_subnet.subnet[1] has been deleted
-   resource "azurerm_subnet" "subnet" {
-       address_prefix                                 = "10.0.4.0/24" -> null
-       address_prefixes                               = [
-           "10.0.4.0/24",
        ] -> null
-       enforce_private_link_endpoint_network_policies = false -> null
-       enforce_private_link_service_network_policies  = false -> null
-       id                                             = "/subscriptions/8b5aa65c-86a2-4818-b2f7-2223b545d57f/resourceGroups/main-vnet/providers/Microsoft.Network/virtualNetworks/main-vnet/subnets/database" -> null
-       name                                           = "database" -> null
-       resource_group_name                            = "main-vnet" -> null
-       service_endpoint_policy_ids                    = [] -> null
-       service_endpoints                              = [] -> null
-       virtual_network_name                           = "main-vnet" -> null
    }

  # module.vnet-main.azurerm_virtual_network.vnet has been deleted
-   resource "azurerm_virtual_network" "vnet" {
-       address_space           = [
-           "10.0.0.0/16",
        ] -> null
-       id                      = "/subscriptions/8b5aa65c-86a2-4818-b2f7-2223b545d57f/resourceGroups/main-vnet/providers/Microsoft.Network/virtualNetworks/main-vnet" -> null
-       location                = "eastus" -> null
-       name                    = "main-vnet" -> null
        tags                    = {
            "costcenter"  = "it"
            "environment" = "dev"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.vnet_main will be created
+   resource "azurerm_resource_group" "vnet_main" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "main-vnet"
    }

  # module.vnet-main.data.azurerm_resource_group.vnet will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "vnet" {
+       id       = (known after apply)
+       location = (known after apply)
+       name     = "main-vnet"
+       tags     = (known after apply)

+       timeouts {
+           read = (known after apply)
        }
    }

  # module.vnet-main.azurerm_subnet.subnet[0] will be created
+   resource "azurerm_subnet" "subnet" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.0.3.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "web"
+       resource_group_name                            = "main-vnet"
+       virtual_network_name                           = "main-vnet"
    }

  # module.vnet-main.azurerm_subnet.subnet[1] will be created
+   resource "azurerm_subnet" "subnet" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.0.4.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "database"
+       resource_group_name                            = "main-vnet"
+       virtual_network_name                           = "main-vnet"
    }

  # module.vnet-main.azurerm_virtual_network.vnet will be created
+   resource "azurerm_virtual_network" "vnet" {
+       address_space         = [
+           "10.0.0.0/16",
        ]
+       dns_servers           = []
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       location              = (known after apply)
+       name                  = "main-vnet"
+       resource_group_name   = "main-vnet"
+       subnet                = (known after apply)
+       tags                  = {
+           "costcenter"  = "it"
+           "environment" = "dev"
        }
+       vm_protection_enabled = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!   vnet_id = "/subscriptions/8b5aa65c-86a2-4818-b2f7-2223b545d57f/resourceGroups/main-vnet/providers/Microsoft.Network/virtualNetworks/main-vnet" -> (known after apply)
```

</p>
</details>